# Задаём фальшивую монету для проверки программы, можно изменить
fake_coin = 8

# Вариант: heavy — тяжелее, light — легче, можно изменить
fake_type = "heavy"


def weight(coin):
    # Обычная монета весит 10, можно изменить
    # Фальшивая отличается на 1, можно изменить
    changes = {
        "heavy": 1,
        "light": -1
    }

    return 10 + changes[fake_type] * (coin == fake_coin)


def weigh(left, right):
    left_weight = sum(map(weight, left))
    right_weight = sum(map(weight, right))

    return {
        (True, False): 1,
        (False, True): -1,
        (False, False): 0
    }[(left_weight > right_weight,
       right_weight > left_weight)]


# -------------------------------
# Первое взвешивание
# -------------------------------

r1 = weigh(
    (1, 2, 3, 4),
    (5, 6, 7, 8)
)

print("1-е взвешивание:", r1)


# -------------------------------
# Второе взвешивание
# -------------------------------

second = {
    0: ((9, 10, 11), (1, 2, 3)),
    1: ((1, 2, 5), (3, 6, 9)),
    -1: ((5, 6, 1), (7, 2, 9))
}

r2 = weigh(*second[r1])

print("2-е взвешивание:", r2)


# -------------------------------
# Третье взвешивание
# -------------------------------

third = {
    # Первое взвешивание равно
    0: {
        1: ((9,), (10,)),
        0: ((9,), (10,)),
        -1: ((9,), (10,))
    },

    # Левая сторона первого взвешивания тяжелее
    1: {
        1: ((1,), (2,)),
        0: ((1,), (2,)),
        -1: ((1,), (2,))
    },

    # Правая сторона первого взвешивания тяжелее
    -1: {
        1: ((5,), (6,)),
        0: ((5,), (6,)),
        -1: ((5,), (6,))
    }
}

left, right = third[r1][r2]

r3 = weigh(left, right)

print("3-е взвешивание:", r3)

print("Настоящая фальшивая монета:", fake_coin)
print("Она:", "тяжелее" if fake_type == "heavy" else "легче")
